### [ 데이터 필터링 ]
- 원하는 데이터를 추출하기 위해서 사용하는 방법
- 원하는 데이터 걸러내겠다는 의미
- 다양한 조건 검사 진행 => 비교 검사 : 같다 == , 같지 않다 != , 크다 > , 크거나 같다 >=, 작다 < , 작거나 같다 <=

(1) 모듈 로딩

In [213]:
import numpy as np
import pandas as pd

(2) 데이터 준비

In [214]:
file = '../DATA/employees.csv'

(3) 데이터 저장

In [215]:
empDF = pd.read_csv(file)

(4) 데이터 확인

(5) 데이터 필터링

In [216]:
'Happy' == 'Happy', 'Happy' == 'happy'

(True, False)

- [ 문제 ] 데이터에서 이름이 Maria인 데이터만 추출

In [217]:
print(empDF.columns, empDF.index, sep='\n\n')

Index(['First Name', 'Gender', 'Start Date', 'Salary', 'Mgmt', 'Team'], dtype='object')

RangeIndex(start=0, stop=1001, step=1)

- bool 값으로 구성된 데이터 ==> 불린인덱싱 (Boolean Indexing)

In [218]:
(empDF['First Name'] == 'Maria').sum()
# True이면 1의 값을 가지니까

6

In [219]:
# True인것만 뽑아서 쓰겠다. (즉 불스 값을 인덱스처럼 쓰겠다.그래서 불린인덱싱)
empDF[empDF['First Name'] == 'Maria']

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
198      Maria  Female   12/27/90   36067.0   True       Product
815      Maria     NaN    1/18/86  106562.0  False            HR
844      Maria     NaN    6/19/85  148857.0  False         Legal
936      Maria  Female    3/14/03   96250.0  False  Business Dev
984      Maria  Female   10/15/11   43455.0  False   Engineering

In [220]:
empDF['First Name'] == 'Maria'

0       False
1       False
2        True
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: First Name, Length: 1001, dtype: bool

In [221]:
mariaMask = (empDF['First Name'] == 'Maria')

print(type(mariaMask), mariaMask.sum(), sep = '\n\n')

<class 'pandas.core.series.Series'>

6

In [222]:
empDF[mariaMask]
# 데이터 프레임에서 트루에 해당하는 행만 뽑아서 필터링하였다.

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
198      Maria  Female   12/27/90   36067.0   True       Product
815      Maria     NaN    1/18/86  106562.0  False            HR
844      Maria     NaN    6/19/85  148857.0  False         Legal
936      Maria  Female    3/14/03   96250.0  False  Business Dev
984      Maria  Female   10/15/11   43455.0  False   Engineering

- [문제] employees 데이터에서 연봉이 50,000이상인 데이터 추출

In [223]:
salaryData = (empDF['Salary'] >= 140000)
salaryData

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [224]:
empDF[salaryData]

    First Name  Gender Start Date    Salary   Mgmt          Team
36      Rachel  Female    2/16/09  142032.0  False  Business Dev
44     Cynthia  Female   11/16/88  145146.0   True       Product
83       Shawn    Male    9/23/05  148115.0   True       Finance
87       Annie  Female    1/30/93  144887.0   True         Sales
96     Cynthia  Female    3/21/94  142321.0  False       Finance
..         ...     ...        ...       ...    ...           ...
948     Ashley  Female    3/31/06  142410.0   True   Engineering
951        NaN  Female    9/14/10  143638.0    NaN           NaN
979     Ernest    Male    7/20/13  142935.0   True       Product
981      James    Male    1/15/93  148985.0  False         Legal
983       John    Male   12/23/82  146907.0  False   Engineering

[80 rows x 6 columns]

- [문제] 성별이 남자이며 연봉이 100000이상인 데이터 조회

In [225]:
empDF['Gender'] == 'Male'

0        True
1        True
2       False
3       False
4        True
        ...
996      True
997      True
998      True
999      True
1000    False
Name: Gender, Length: 1001, dtype: bool

In [226]:
empDF['Salary'] >= 100000

0       False
1       False
2        True
3        True
4        True
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Salary, Length: 1001, dtype: bool

- 여러 개의 조건이 모두 True여야만 하는 조건 ==> AND 조건
    * 문법 :  조건1 & 조건2 & 조건3 & ... & 조건 N
    * 연산자 : & 앰퍼센트
    * 결과 : True/False

In [227]:
mask = (empDF['Gender'] == 'Male')&(empDF['Salary'] >= 148000)
type(mask), mask.sum()

(pandas.core.series.Series, 5)

In [228]:
empDF[mask]

    First Name Gender Start Date    Salary   Mgmt     Team
83       Shawn   Male    9/23/05  148115.0   True  Finance
318        Roy   Male     8/6/06  148225.0  False  Finance
800   Clarence   Male     8/5/89  148941.0  False  Product
850    Charles   Male     9/3/97  148291.0  False      NaN
981      James   Male    1/15/93  148985.0  False    Legal

- 여러 개의 조건 중 1개 이상이 True면 True가 되는 조건 ==> OR 조건
    * 문법 :  조건1 | 조건2 | 조건3 | ... | 조건 N
    * 연산자 : | 파이프 
    * 결과 : True/False

- [문제] employees 데이터에서 입사일이 1993년 1월 1일 이전이거나 또는 팀이 없는 사람 데이터 조회

In [229]:
empDF['Start Date'] = pd.to_datetime(empDF['Start Date'])

C:\Users\kdp\AppData\Local\Temp\ipykernel_10024\1557590731.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  empDF['Start Date'] = pd.to_datetime(empDF['Start Date'])

In [230]:
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 47.0+ KB

In [231]:
one = empDF['Start Date'] >= '1993-01-01'
two = empDF['Mgmt'] == False

In [232]:
empDF[one|two].head()

  First Name  Gender Start Date    Salary   Mgmt       Team
0    Douglas    Male 1993-08-06       NaN   True  Marketing
1     Thomas    Male 1996-03-31   61933.0   True        NaN
2      Maria  Female        NaT  130590.0  False    Finance
3      Jerry     NaN 2005-03-04  138705.0   True    Finance
4      Larry    Male 1998-01-24  101004.0   True         IT

In [233]:
empDF['Team'].isin(['Sales', 'Legal', 'Marketing'])

0        True
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Team, Length: 1001, dtype: bool

- 구간 지정 검사 불린 메서드 => DF.between(low, high)

In [234]:
(empDF['Salary']>=80000) & (empDF['Salary'] < 90000)

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [235]:
empDF['Salary'].between(80000, 90000)

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [236]:
empDF['Salary'].between(80000, 90000, inclusive = 'both')
#inclusive = > both, neither, left, right

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [237]:
empDF['First Name'].str.upper()

0       DOUGLAS
1        THOMAS
2         MARIA
3         JERRY
4         LARRY
         ...
996     PHILLIP
997     RUSSELL
998       LARRY
999      ALBERT
1000        NaN
Name: First Name, Length: 1001, dtype: object

In [238]:
empDF['First Name'].str.lower()

0       douglas
1        thomas
2         maria
3         jerry
4         larry
         ...
996     phillip
997     russell
998       larry
999      albert
1000        NaN
Name: First Name, Length: 1001, dtype: object

In [239]:
empDF['First Name'].str.replace('a', 'aa')

0       Douglaas
1        Thomaas
2        Maariaa
3          Jerry
4         Laarry
          ...
996      Phillip
997      Russell
998       Laarry
999       Albert
1000         NaN
Name: First Name, Length: 1001, dtype: object